app/controllers/flowers_controller.rb

SELECT "flowers".* FROM "flowers"
---
  def index
    @flowers = Flower.all

SELECT  "flowers".* FROM "flowers" WHERE "flowers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_flower
    @flower = Flower.find(params[:id])